In [27]:
import pymysql
import getpass as gp
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [28]:
# conn1 = pymysql.connect(host='127.0.0.1', user='root', password = input(), db='employees', charset='utf8mb4')
# conn2 = pymysql.connect(host='127.0.0.1', user='reader', password = input(), db='employees', charset='utf8mb4')

In [29]:
# 계정 정보 사전
accounts = {
    'edward': {'host': '192.168.0.27', 'db': 'employees'},
    # 여기에 계정 추가 가능 192.168.0.28 127.0.0.1
}

def connect_to_db():
    user = input("ID: ").strip()
    if user not in accounts:
        raise ValueError("등록되지 않은 사용자 ID")

    password = gp.getpass("비밀번호: ")
    info = accounts[user]

    conn = pymysql.connect(
        host=info['host'],
        user=user,
        password=password,
        db=info['db'],
        charset='utf8mb4',
    )
    return conn

def q(query):
    return pd.read_sql(query, conn)

def p(i):
    return print(i)

In [30]:
conn = connect_to_db()

In [31]:
p(q("SELECT current_role();"))

  current_role()
0           NONE

In [32]:
p(q("SELECT user, host, account_locked FROM mysql.user;"))

               user          host account_locked
0     role_emp_read             %              Y
1    role_emp_write             %              Y
2            reader     127.0.0.1              N
3            writer     127.0.0.1              N
4            edward  192.168.0.28              N
5  mysql.infoschema     localhost              Y
6     mysql.session     localhost              Y
7         mysql.sys     localhost              Y
8              root     localhost              N

In [33]:
q('SELECT * FROM employees;')

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [34]:
q("SELECT birth_date, first_name, last_name FROM employees WHERE birth_date BETWEEN '1960-01-01' AND '1965-12-31';")

        birth_date first_name     last_name
0       1964-06-02    Bezalel        Simmel
1       1963-06-01  Duangkaew      Piveteau
2       1960-10-04   Patricio     Bridgland
3       1963-06-07  Eberhardt        Terkki
4       1961-05-02   Kazuhito   Cappelletti
...            ...        ...           ...
117133  1963-11-03     Khaled       Kohling
117134  1962-02-26      Pohua       Sichman
117135  1960-10-12     Siamak      Salverda
117136  1963-06-04   DeForest  Mullainathan
117137  1961-08-03    Berhard        Lenart

[117138 rows x 3 columns]